micropython/micropython/ports/esp32/boards/SEEED_XIAO_ESP32_C3/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME               "Seeed XIAO ESP32C3"
#define MICROPY_HW_MCU_NAME                 "ESP32C3"